import org.apache.log4j.*;


public class ConnectionManager {
    final static Logger logger = Logger.getLogger(ConnectionManager.class);

    /**
     * Тут потрібно написати підключення до перщої бази
     * потім перевірку чи не померла вона
     * написати метод для відновлення після відмови
     * підключення до резервної
     * реалізація через пули бази даних
     * час від часу перевіряти чи перша база диних відновилася
     * якщо відновилася перепідключитися до першої
     *
     *
     * Використати логування для кожної дії
     * записувати ці дії у дата сторадж
     * пошук даних по дата стораджу
     *
     */
}
